PrevFeedbackSample.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <Action s:mustUnderstand="1" xmlns="http://schemas.microsoft.com/ws/2005/05/addressing/none">xri://@navimedix.com/navinet/drug-authorizations/IDrugAuthServicePublic/UpdateDrugAuthorization</Action>
  </s:Header>
  <s:Body>
    <UpdateDrugAuthorization xmlns="xri://@navimedix.com/navinet/drug-authorizations">
      <request xmlns:d4p1="xri://@navimedix.com/navinet/drug-authorizations/(+schema*update-drug-authorization.xsd*($v*1.0))" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <d4p1:Version>1.00</d4p1:Version>
        <d4p1:DrugAuthorizationList xmlns:d5p1="xri://@navimedix.com/navinet/drug-authorizations/(+schema*common-drug-authorization.xsd*($v*1.0))">
          <d4p1:DrugAuthorization>
            <d5p1:Id>9DB6DG</d5p1:Id>
            <d5p1:ReturnUrl>https://navinet.covermymeds.com/request/view/9DB6DG</d5p1:ReturnUrl>
            <d5p1:Disposition>New</d5p1:Disposition>
            <d5p1:PlanOutcome>Unknown</d5p1:PlanOutcome>
            <d5p1:PlanOutcomeNote i:nil="true" />
            <d5p1:CreatedMethod>Prospective</d5p1:CreatedMethod>
            <d5p1:CreatedDateTime>2012-05-14T12:17:00-04:00</d5p1:CreatedDateTime>
            <d5p1:CreatedDisplayName>Three Avanesova</d5p1:CreatedDisplayName>
            <d5p1:UpdatedDateTime>2012-05-14T12:17:15.1962262-04:00</d5p1:UpdatedDateTime>
            <d5p1:AppealExpirationDateTime i:nil="true" />
            <d5p1:FormName>masshealth__medicaid_hypnotics_11034</d5p1:FormName>
            <d5p1:NotificationFlag>false</d5p1:NotificationFlag>
            <d5p1:Originator>
              <d5p1:SystemName>MPP</d5p1:SystemName>
              <d5p1:SystemVersion>1.00</d5p1:SystemVersion>
              <d5p1:OfficeId>175134</d5p1:OfficeId>
              <d5p1:UserId>364337</d5p1:UserId>
            </d5p1:Originator>
            <d5p1:Recipient>
              <d5p1:SystemName>MPP</d5p1:SystemName>
              <d5p1:OfficeId>175134</d5p1:OfficeId>
              <d5p1:UserId>364337</d5p1:UserId>
            </d5p1:Recipient>
            <d5p1:Prescriber i:nil="true" />
            <d5p1:Patient>
              <d5p1:Id i:nil="true" />
              <d5p1:DisplayName>Jimmy Dean</d5p1:DisplayName>
              <d5p1:DateOfBirth i:nil="true" />
            </d5p1:Patient>
            <d5p1:MedicationPrescribed>
              <d5p1:DrugDescription>Ambien CR 12.5 MG TBCR</d5p1:DrugDescription>
              <d5p1:Quantity i:nil="true" />
              <d5p1:AdditionalText i:nil="true" />
              <d5p1:Refills i:nil="true" />
              <d5p1:Substitutions i:nil="true" />
            </d5p1:MedicationPrescribed>
            <d5p1:Payer i:nil="true" />
            <d5p1:Pharmacy i:nil="true" />
            <d5p1:AttachmentList i:nil="true" />
          </d4p1:DrugAuthorization>
        </d4p1:DrugAuthorizationList>
      </request>
    </UpdateDrugAuthorization>
  </s:Body>
</s:Envelope>